dic = {"一": {"1": "英语 ", "2": "数学", "3": "语文", "4": "物理", "5": "政治", "6": "生物",
             "7": "自习", "8": "自习", "晚一": "语文", "晚二": "生物", "晚三": "化学"},
       "二": {"1": "数学", "2": "语文", "3": "物理", "4": "英语", "5": "政治", "6": "生物", "7": "自习",
             "8": "自习", "晚一": "英语", "晚二": "数学", "晚三": "自习"},
       "三": {"1": "语文", "2": "物理", "3": "英语", "4": "数学", "5": "生物", "6": "政治", 7: "自习",
             "8": "自习", "晚一": "物理", "晚二": "语文", "晚三": "自习"},
       "四": {"1": "物理", "2": "英语", "3": "数学", "4": "语文", "5": "政治", "6": "生物", 7: "自习",
             "8": "自习", "晚一": "政治", "晚二": "生物", "晚三": "英语"},
       "五": {"1": "英语", "2": "数学", "3": "语文", "4": "物理", "5": "政治", "6": "生物", '7': "自习",
             "8": "自习", "晚一": "数学", "晚二": "自习", "晚三": "物理"},
       "六": {"1": "数学", '2': "语文", '3': "物理", '4': "英语", '5': "政治", '6': "生物", '7': "自习",
             '8': "自习", "晚一": "自习", "晚二": "政治", "晚三": "语文"},
       "日": {'1': "语文", '2': "物理", '3': "英语", '4': "数学", '5': "休息", '6': "休息", '7': "自习",
             '8': "自习", "晚一": "物理", "晚二": "英语", "晚三": "数学"}}
while True:
    week = input("今天是周（）")
    counts = dic.get(week)
    if counts is not None:
        order = (input("要查第（）节课"))
        if order is not None:
            print(f"这节课是{counts[order]}")
            break
        else:
            print("您输入的数据无效，只需要输入阿拉伯数字即可")
    else:
        print("您输入的内容无效，只需要输入一个大写的中文即可")

